print('Задача 5. Великий и могучий')

# Паоло изучает русский язык: занимается по учебникам, читает книги, слушает музыку. Ему особенно понравилась книга «Преступление и наказание». Паоло решил найти самое длинное слово в этой книге, чтобы сравнить его с аналогом на своём языке.

# Что нужно сделать

# Напишите программу, которая получает на вход текст и находит длину самого длинного слова в нём. Слова в тексте разделяются одним пробелом.

# Пример:

# Введите текст: Меня зовут Пётр.
# Самое длинное слово, букв: 5.

# Введите текст: Меня зовут Василий
# Самое длинное слово, 7 букв

text = input('Введите текст: ')
longest_word = 0
counter = 0
for simbol in text:
    if simbol == ' ':
        if counter > longest_word:
            longest_word = counter
        counter = 0
    else:
        counter += 1

if counter > longest_word:
    longest_word = counter

print(f'Самое длинное слово, {longest_word} букв')
